In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [42]:
df1 = DataFrame({'key':['X','Y','Z','X'], 'data_set_1':[1,2,3,4]})
df1

  key  data_set_1
0   X           1
1   Y           2
2   Z           3
3   X           4

In [41]:
df2 = DataFrame({'key':['X','B','C'], 'data_set_2':[4,5,6]})
df2

  key  data_set_2
0   X           4
1   B           5
2   C           6

In [29]:
pd.merge(df1,df2)

  key  data_set_1  data_set_2
0   X           1           4
1   X           4           4

In [32]:
pd.merge(df1,df2,on='key')

  key  data_set_1  data_set_2
0   X           1           4
1   X           4           4

In [36]:
pd.merge(df1,df2,on='key',how='inner')

  key  data_set_1  data_set_2
0   X           1           4
1   X           4           4

In [38]:
pd.merge(df1,df2,on='key',how='outer')

  key  data_set_1  data_set_2
0   X         1.0         4.0
1   X         4.0         4.0
2   Y         2.0         NaN
3   Z         3.0         NaN
4   B         NaN         5.0
5   C         NaN         6.0

In [39]:
pd.merge(df1,df2,on='key',how='left')

  key  data_set_1  data_set_2
0   X           1         4.0
1   Y           2         NaN
2   Z           3         NaN
3   X           4         4.0

In [43]:
pd.merge(df1,df2,on='key',how='right')

  key  data_set_1  data_set_2
0   X         1.0           4
1   X         4.0           4
2   B         NaN           5
3   C         NaN           6